''' 집합 자료형 
중복x, 순서x
중복제거용으로 많이 쓰임
교집합,합집합,차집합 구할 때 쓰임
'''
s=set()
s1=set([1,2,3]) #{1,2,3}
s2=set("hello") #{'e','h','l','o'}

# &교집합, |합집합, -차집합
s1=set([1, 2, 3, 4, 5, 6])
s2=set([4, 5, 6, 7, 8, 9])
print(s1 & s2) #{4, 5, 6}
print(s1 | s2) #{1, 2, 3, 4, 5, 6, 7, 8, 9}
print(s1 - s2) #{1, 2, 3}

# add() 값 1개 추가하기
s1.add(7) 
print(s1) #{1, 2, 3, 4, 5, 6, 7}
# update() 값 여러개 추가하기
s1.update([8,9])
print(s1) #{1, 2, 3, 4, 5, 6, 7, 8, 9}
# remove() 특정값제거하기
s1.remove(7)
print(s1) #{1, 2, 3, 4, 5, 6, 8, 9}